# ==================== ТАБЛИЦА РЕДКОСТЕЙ И ВСЕ КАРТЫ ====================
REAL_CARDS_POOL = {
    "⚪ Обычная": [
        {"file": "5.jpg", "name": "Солнечный Самурай ☀️", "price": 10, "hp": 65, "atk": 13, "def": 5},
        {"file": "6.jpg", "name": "Таинственный Лось 🦌", "price": 10, "hp": 60, "atk": 15, "def": 4},
        {"file": "9.jpg", "name": "Страж Дубравы 🌲", "price": 10, "hp": 70, "atk": 11, "def": 6},
        {"file": "11.jpg", "name": "Пчела-Сборщица 🐝", "price": 2, "hp": 60, "atk": 15, "def": 4}
    ],
    "🟢 Необычная": [
        {"file": "12.jpg", "name": "Трутень-Охранник 🛡️", "price": 4, "hp": 80, "atk": 16, "def": 10}
    ],
    "🔵 Редкая": [
        {"file": "4.jpg", "name": "Меха-Бык 🐂", "price": 30, "hp": 100, "atk": 20, "def": 12},
        {"file": "7.jpg", "name": "Призрак Леса 👻", "price": 30, "hp": 95, "atk": 22, "def": 9},
        {"file": "8.jpg", "name": "Лесной Хакер 💻", "price": 30, "hp": 90, "atk": 25, "def": 7},
        {"file": "13.jpg", "name": "Медоносный Разведчик 🗺️", "price": 6, "hp": 95, "atk": 22, "def": 9}
    ],
    "🟣 Эпическая": [
        {"file": "14.jpg", "name": "Термит-Разрушитель 🪵", "price": 12, "hp": 130, "atk": 28, "def": 18}
    ],
    "🟠 Легендарная": [
        {"file": "15.jpg", "name": "Генерал Армии Листорезов 🍁", "price": 18, "hp": 160, "atk": 35, "def": 20}
    ],
    "🔴 Мифическая": [
        {"file": "16.jpg", "name": "Кибер-Личинка 💻", "price": 30, "hp": 200, "atk": 42, "def": 25}
    ],
    "✨ Древняя": [
        {"file": "17.jpg", "name": "Королева Матка 👑", "price": 50, "hp": 300, "atk": 50, "def": 35}
    ],
    "💎 Секретная": [
        {"file": "0.jpg", "name": "𝑴𝒐𝒐𝒏 🌙", "price": 100, "hp": 450, "atk": 80, "def": 50},
        {"file": "1.jpg", "name": "金 sunny🌲 김지ха | DA 🐂", "price": 100, "hp": 400, "atk": 85, "def": 45},
        {"file": "2.jpg", "name": "👻losnya🐂🌲", "price": 100, "hp": 420, "atk": 75, "def": 55},
        {"file": "3.jpg", "name": "Дониёр 🌲", "price": 100, "hp": 410, "atk": 90, "def": 40}
    ],
    "🌟 Божественная": [
        {"file": "10.jpg", "name": "𝑴𝒐𝒐𝒏🌳 Покровитель Леса", "price": 250, "hp": 650, "atk": 110, "def": 60}
    ],
    "👑 Эксклюзивная": [
        {"file": "18.jpg", "name": "金 Солнечный Разум Улья ☀️", "price": 140, "hp": 500, "atk": 90, "def": 80}
    ]
}

EMPTY_RESPONSES = [
    "Эта ячейка оказалась пустой... Открой ещё разок! 😔",
    "Эта карта пуста, открой ещё 😔",
    "Увы, пак пуст. Повезет в следующий раз! 💨"
]
